Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This will cause all rest endpoints to be resolve relative to `/api`, so the endpoint above with `@Path("rest")` would be accessible at `/api/rest/`. You can also set the `quarkus.resteasy-reactive.path` build time property to set the root path if you don't want to use an annotation.
ja_jp: これにより、すべての rest エンドポイントは `/api` に対する相対パスで解決されるようになり、上記の `@Path ("rest")` のエンドポイントには `/api/rest/` でアクセスすることができるようになります。また、アノテーションを使用したくない場合は、 `quarkus.resteasy-reactive.path` ビルド時のプロパティーを設定して、ルートパスを設定することができます。

source: This will change the `topbar` to have a dropdown box with the urls provided:
ja_jp: これにより、 `topbar` は、提供されたURLのドロップダウンボックスを持つように変更されます。

source: This will clear the <<configuration-reference,session cookie>> to log you out.
ja_jp: これにより、<<configuration-reference,session cookie>> がクリアされ、ログアウトできます。

source: This will compile and package your code.
ja_jp: これでコードがコンパイルされ、パッケージ化されます。

source: This will compile the code and run the unit tests included within the generated project. Unit testing is the same as any other Java project and does not require running on Amazon. Quarkus dev mode is also available with this extension.
ja_jp: これでコードがコンパイルされ、生成されたプロジェクト内に含まれるユニットテストが実行されます。ユニットテストは他のJavaプロジェクトと同じで、Amazonで実行する必要はありません。Quarkus dev モードもこのエクステンションで利用できます。

source: This will create a default service for your App Engine application.
ja_jp: これにより、App Engineアプリケーションのデフォルトサービスが作成されます。

source: This will create a folder called 'code-with-quarkus' in your current working directory using default groupId, artifactId and version values (groupId='org.acme', artifactId='code-with-quarkus' and version='1.0.0-SNAPSHOT').
ja_jp: これにより、デフォルトの groupId、artifactId、および version の値 (groupId='org.acme'、artifactId='code-with-quarkus' および version='1.0.0-SNAPSHOT') を使用して、現在の作業ディレクトリーに 'code-with-quarkus' という名前のフォルダーが作成されます。

source: This will create a folder called `code-with-quarkus` in your current working directory using default `groupId`, `artifactId` and `version` values (`groupId='org.acme'`, `artifactId='code-with-quarkus'` and `version='1.0.0-SNAPSHOT'`).
ja_jp: これにより、現在の作業ディレクトリに、デフォルトの `groupId` 、 `artifactId` 、 `version` の値（ `groupId='org.acme'` 、 `artifactId='code-with-quarkus'` 、 `version='1.0.0-SNAPSHOT'` ）を使用して、 `code-with-quarkus` というフォルダが作成されます。

source: This will create a remote repository in your Heroku account, and it should have also added a heroku remote url to your local repository which you can view using `git remote -v`:
ja_jp: これにより、Heroku アカウントにリモートリポジトリーが作成され、ローカルリポジトリーに heroku リモート URL も追加されます。これは、`git remote -v` を使用して表示できます。

source: This will disable all access checks, which allows the test to access secured endpoints without needing to authenticate.
ja_jp: これにより、すべてのアクセスチェックが無効になり、認証を必要とせずに保護されたエンドポイントにアクセスできるようになります。

source: This will display your data in its raw (serialised) JSON value:
ja_jp: データは、生の (シリアル化された) JSON 値で表示されます。

source: This will do a production build of the static React assets and copy them over into the default Quarkus directory for static files.
ja_jp: これにより、静的なReactアセットのプロダクションビルドが行われ、Quarkusのデフォルトの静的ファイル用ディレクトリにコピーされます。

source: This will expand the `HOST` environment variable and use `AUTO` as the default value if `HOST` is not set.
ja_jp: これにより、環境変数 `HOST` が展開され、 `HOST` が設定されていない場合、 `AUTO` がデフォルト値として使用されます。

source: This will expand the `HOST` environment variable and use the value of the property `remote.host` as the default value if `HOST` is not set.
ja_jp: これは `HOST` 環境変数を展開し、 `HOST` が設定されていない場合は、プロパティー `remote.host` の値をデフォルト値として使用します。

source: This will force a scan for changed files, and will perform a live reload with and changes. Note that even if there are no changes the application will still restart. This will still work even if live reload is disabled.
ja_jp: これにより、変更されたファイルを強制的にスキャンし、変更に対してライブリロードを実行します。ライブリロードが無効になっていても、この機能は動作します。

source: This will generate a configuration map key named `quarkus.some."cache-name"` instead of `quarkus.some."namespace"`.
ja_jp: これにより、 `quarkus.some."namespace"` の代わりに `quarkus.some."cache-name"` という名前の設定マップキーが生成されます。

source: This will generate this OpenAPI schema:
ja_jp: これにより、このOpenAPIスキーマが生成されます。

source: This will get injected with the (only) active session.
ja_jp: これには、(唯一の) アクティブなセッションが注入されます。

source: This will give you access to the current theme, that the user can change at any time.
ja_jp: これにより、ユーザーがいつでも変更できる現在のテーマにアクセスできます。

source: This will give you access to two base classes for creating these tests.
ja_jp: そうすることで、テストを作成するための 2 つのベースクラスにアクセスできるようになります。

source: This will give you similar information as the `@OpenAPIDefinition` example above.
ja_jp: これにより、上記の `@OpenAPIDefinition` の例と同様の情報が得られます。

source: This will give you the connection state to the backend. Dev UI is connected to the backend with a Web Socket. The UI might loose connection to the backend in certain cases, example a Hot reload is in progress or the user actually stopped the server.
ja_jp: これにより、バックエンドへの接続状態が得られます。Dev UI は Web Socket を使用してバックエンドに接続されています。UI は特定のケースでバックエンドへの接続を失う可能性があります。たとえば、ホットリロードが進行中である場合や、ユーザーが実際にサーバーを停止した場合などです。

source: This will in turn provide the Kafka client with a `ssl.engine.factory.class` implementation.
ja_jp: これにより、Kafka クライアントに `ssl.engine.factory.class` 実装が提供されます。

source: This will include the `X-Content-Type-Options: nosniff` HTTP Header on responses for requests performed on any resource in the application.
ja_jp: これにより、アプリケーション内の任意のリソースに対して実行されるリクエストのレスポンスに、 `X-Content-Type-Options: nosniff` HTTP ヘッダーが含まれます。

source: This will include the following dependencies in your build file:
ja_jp: これには、ビルドファイルの次の依存関係が含まれます。

source: This will include the native library for `linux-aarch64` in your project, in addition to the one matching your machine.
ja_jp: これにより、ご使用のマシンに合ったライブラリーに加えて、 `linux-aarch64` のネイティブライブラリーがプロジェクトに含まれます。

source: This will inject the `EntityManager` of the default persistence unit.
ja_jp: これは、デフォルトの永続化ユニットの `EntityManager` を注入します。

source: This will inject the `Mutiny.SessionFactory` of the default persistence unit.
ja_jp: これにより、デフォルトの永続化ユニットの `Mutiny.SessionFactory` が注入されます。

source: This will inject the `SearchSession` of the default persistence unit.
ja_jp: これは、デフォルトの永続化ユニットの `SearchSession` をインジェクションします。

source: This will just return the request body and it's useful for testing purposes.
ja_jp: これは単にリクエストボディを返すだけなので、テスト目的として便利です。

source: This will make the `application.properties` file available to the script, and process the configuration as usual.
ja_jp: これにより、 `application.properties` ファイルがスクリプトで使用できるようになり、通常どおり設定が処理されます。

source: This will map the `info:cacheInfos` value to this supplier in your extension's xref:building-my-first-extension.adoc#description-of-a-quarkus-extension[`runtime module`]:
ja_jp: これにより、 エクステンションの link:building-my-first-extension.html#description-of-a-quarkus-extension[`runtime module`] で `info:cacheInfos` の値が、このサプライヤーにマッピングされます。

source: This will no longer work, because the url isn't known at build time. Instead, replace the `url` method with `dynamicUrlJsonRPCMethodName`, link:/guides/dev-ui#runtime-external-links[passing in an RPC method name].
ja_jp: URL はビルド時には不明であるため、これは機能しなくなります。代わりに、 `url` メソッドを `dynamicUrlJsonRPCMethodName` に置き換え、 link:/guides/dev-ui#runtime-external-links[RPC メソッド名を渡します] 。

source: This will only work on platforms that support <<native-transport>>.
ja_jp: これは、<<native-transport>> をサポートするプラットフォームでのみ動作します。

source: This will only work on platforms that support xref:native-transport[Use native transports].
ja_jp: これは xref:native-transport[ネイティブ・トランスポートの使用] サポートするプラットフォームでのみ機能します。

source: This will only work when the entity extends `PanacheMongoEntityBase` and not `PanacheMongoEntity`, as the ID field also needs to be included in the constructor.
ja_jp: これは、エンティティが `PanacheMongoEntity` ではなく `PanacheMongoEntityBase` を拡張している場合にのみ機能します。なぜなら、ID フィールドもコンストラクタに含める必要があるからです。

source: This will produce:
ja_jp: これにより、次が生成されます。

source: This will provide you a URL similar to e.g.: `http://broker-ingress.knative-eventing.svc.cluster.local/knativetutorial/default`. Remember this URL.
ja_jp: これにより、例えば以下のようなURLが表示されます: `http://broker-ingress.knative-eventing.svc.cluster.local/knativetutorial/default` 。このURLを覚えておいてください。

source: This will re-run every failing test
ja_jp: これは、失敗したすべてのテストを再実行します。

source: This will re-run every test
ja_jp: これは、すべてのテストを再実行します。

source: This will rebuild the `aggregator` container and restart its service. Once that's done, you can invoke the service's REST API to obtain the temperature data for one of the existing stations. To do so, you can use `httpie` in the tooling container launched before:
ja_jp: これにより、 `aggregator` コンテナーが再構築され、サービスが再起動されます。これが完了したら、サービスの REST API を呼び出して、既存のステーションの 1 つの温度データを取得することができます。そのためには、前に起動したツーリングコンテナで `httpie` を使用します。

source: This will remove the `RemovedResource.class` file from the `io.quarkus:quarkus-integration-test-shared-library` artifact.
ja_jp: これにより、 `io.quarkus:quarkus-integration-test-shared-library` のアーティファクトから `RemovedResource.class` のファイルが削除されます。

source: This will result in the following message in `gdb`:
ja_jp: これにより、 `gdb` に次のようなメッセージが表示されます。

source: This will result in the following output:
ja_jp: これにより、次のような出力が得られます。

source: This will return a *HTTP 404 (Not Found)* on the Swagger UI page.
ja_jp: これは Swagger UI ページで *HTTP 404 (Not Found) を* 返します。

source: This will return a result like this for example:
ja_jp: これは、例えばこのような結果を返します:

source: This will run the test with an identity possessing permission `see` and action `detail`. Consequently, call to the `getDetail` method declared in the example below will succeed:
ja_jp: これにより、権限が `see` とアクションが `detail` のアイデンティティーを使用してテストが実行されます。 その結果、以下の例で宣言されている `getDetail` メソッドの呼び出しは成功します。

source: This will run the test with an identity with an attribute of type `Long` named `answer`.
ja_jp: これにより、 `answer` という名前の `Long` 型の属性を持つアイデンティティーを使用してテストが実行されます。

source: This will run the test with an identity with the given username and roles. Note that these can be combined, so you can disable authorization while also providing an identity to run the test under, which can be useful if the endpoint expects an identity to be present.
ja_jp: これは、指定されたユーザー名とロールを持つ ID でテストを実行します。これらを組み合わせることができるので、認証を無効にしながらテストを実行するための ID を提供することができることに注意してください。

source: This will set the `Cache-Control` header to `none` when `/index.html` is called.
ja_jp: これにより、 `/index.html` が呼び出されたときに、 `Cache-Control` のヘッダに `none` が設定されます。

source: This will set the logo for all UIs (not just swagger ui), so in this case also GraphQL-UI and Health-UI (if included).
ja_jp: これにより、（swagger uiだけでなく）すべてのUIのロゴが設定されるので、ここではGraphQL-UIやHealth-UI（含まれている場合）も設定されます。

source: This will start a Docker container that mimics Amazon's Lambda's deployment environment. Once the environment is started you can invoke the example lambda in your browser by going to:
ja_jp: これで Amazon の Lambda のデプロイ環境を模した Docker コンテナーが起動します。環境が起動したら、ブラウザで以下を開くとサンプルの Lambda を実行できます。

source: This will start a Docker container that mimics Amazon's Lambda's deployment environment. Once the environment is started, you can invoke the example lambda in your browser by going to:
ja_jp: これで Amazon の Lambda のデプロイ環境を模した Docker コンテナーが起動します。環境が起動したら、ブラウザで以下を開くとサンプルの Lambda を実行できます。

source: This will start a non-durable empty database: ideal for a quick experiment!
ja_jp: これは、永続化されない空のデータベースを起動します。簡単な実験に最適です!

source: This will trigger Quarkus to create 3 OpenAPI documents.
ja_jp: これにより、Quarkus は 3 つの OpenAPI ドキュメントを作成します。

source: This will use the SPI hooks available with the OTel Autoconfiguration. You can create a simple Sampler class:
ja_jp: これにより、OTel 自動設定で使用可能な SPI フックが使用されます。 シンプルな Sampler クラスを作成できます。

source: This will use your annotated constructor to create the query. (`select new PersonName(name) from ...`)
ja_jp: これにより、アノテーションが付けられたコンストラクターを使用してクエリが作成されます。(`select new PersonName(name) from ...`)

source: This will work as expected, but if you try to read this InputStream object in a custom exception mapper, you will receive a `BlockingNotAllowedException` exception. This is because `ResponseExceptionMapper` classes are run on the Event Loop thread executor by default - which does not allow to perform IO operations.
ja_jp: これは期待どおりに動作しますが、この InputStream オブジェクトをカスタム例外マッパーで読み取ろうとすると、 `BlockingNotAllowedException` 例外が発生します。これは、 `ResponseExceptionMapper` クラスがデフォルトでイベントループスレッドエグゼキューターで実行され、IO 操作を実行できないためです。

source: This will, rather than creating a `Type` or `Input` in GraphQL, map to a String scalar.
ja_jp: これは、GraphQLで `Type` や `Input` を作成するのではなく、Stringのスカラーにマッピングされます。

source: This will:
ja_jp: これにより、以下のことが行われます。

source: This work resulted in numerous pull requests across Quarkus, Jandex, and even ByteBuddy.
ja_jp: この作業により、Quarkus、Jandex、さらにはByteBuddyにわたる多数のプルリクエストが生まれました。

source: This works equally well when the JSON content is a request body or is wrapped in a `Uni`, `Multi`, `CompletionStage` or `Publisher`.
ja_jp: これは、JSONコンテンツがリクエストボディである場合や、 `Uni`, `Multi`, `CompletionStage`, `Publisher` で包まれている場合にも同様に機能します。

source: This would generate the following Ingress resource:
ja_jp: この場合、以下のような Ingress リソースが生成されます。

source: This would generate the following `hostAliases` section in the `deployment` definition:
ja_jp: これにより、 `deployment` 定義の中に以下の `hostAliases` セクションが生成されます。

source: This would generate the following `nodeSelector` section in the `deployment` definition:
ja_jp: これにより、`deployment` 定義に次の `nodeSelector` セクションが生成されます。

source: This would generate the following entry in the `container` section:
ja_jp: これにより、 `container` セクションに以下のエントリが生成されます。

source: This would generate the following in the `env` section of your container:
ja_jp: これにより、コンテナーの `env` セクションに以下のようなものが生成されます。

source: This, however, may result in an `AnalysisError\$ParsingError` due to an `UnresolvedElementException` at build time. This is often caused because the application references a class from an https://maven.apache.org/guides/introduction/introduction-to-optional-and-excludes-dependencies.html#optional-dependencies[optional dependency].
ja_jp: しかし、この場合、ビルド時に `AnalysisError\$ParsingError` due to an `UnresolvedElementException` が発生することがあります。これは、アプリケーションが link:https://maven.apache.org/guides/introduction/introduction-to-optional-and-excludes-dependencies.html#optional-dependencies[オプションの依存関係] からクラスを参照するために起こることが多いです。

source: Those are the entry points to the service that can be consumed by clients.
ja_jp: これらは、クライアントが実行するサービスへのエントリーポイントとなります。

source: Those relational databases that are running in a container are started using Testcontainers and support "reusable instances"; this implies that if you add the property `testcontainers.reuse.enable=true` in your Testcontainers configuration file, a property file named `.testcontainers.properties` in your user home, then the databases will not be stopped aggressively after each run, and can be reused.
ja_jp: `testcontainers.reuse.enable=true` コンテナで動作しているこれらのリレーショナル・データベースは、Testcontainersを使用して起動され、「再利用可能なインスタンス」をサポートしています。これは、Testcontainersの設定ファイルに、ユーザーホームの `.testcontainers.properties` というプロパティファイルを追加すれば、データベースが実行ごとに積極的に停止せず、再利用が可能になることを意味しています。

source: Those templates are able to use data which contains:
ja_jp: これらのテンプレートは、以下を含むデータを使用することができます:

source: Though it is possible to override the configuration key name using the `name` attribute of `@ConfigItem`, normally this should only be done in cases where (for example) the configuration key name is the same as a Java keyword.
ja_jp: `@ConfigItem` の `name` 属性を使用して設定キー名を上書きすることは可能ですが、通常、これは (たとえば) 設定キー名が Java キーワードと同じである場合にのみ実行する必要があります。

source: Though the SmallRye Config project is used for implementation, the standard `@ConfigProperty` annotation does not have the same semantics that are needed to support configuration within extensions.
ja_jp: SmallRye Config プロジェクトが実装に使用されますが、標準の `@ConfigProperty` アノテーションには、エクステンション内の設定をサポートするために必要なセマンティクスがありません。

source: Though these implicit converters use reflection, Quarkus will automatically ensure that they are loaded at the appropriate time.
ja_jp: これらの暗黙的なコンバーターはリフレクションを使用しますが、Quarkus はそれらが適切なタイミングでロードされることを自動的に保証します。

source: Thread ID
ja_jp: スレッドID

source: Thread name
ja_jp: スレッド名

source: Thread safety: only one thread can access the object stored in the thread local - preventing concurrent accesses.
ja_jp: スレッドの安全性: スレッドローカルに格納されたオブジェクトにアクセスできるのは 1 つのスレッドのみであり、同時アクセスを防止します。

source: Thread stacks
ja_jp: スレッドスタック

source: Three API flavors are exposed:
ja_jp: 3種類のAPIが公開されています:

source: Three BOMs are available:
ja_jp: 3つのBOMが利用可能です。

source: Three Phases of Bootstrap and Quarkus Philosophy
ja_jp: ブートストラップの 3 つのフェーズと Quarkus 哲学

source: Three development and execution models
ja_jp: 3 つの開発および実行モデル

source: Throughout the course of this guide, the following JPA Entity will be used:
ja_jp: このガイドでは、以下のJPA Entityを使用しています。

source: Throughput icon
ja_jp: スループットのアイコン

source: Thus the list of noteworthy new features is a bit short for this release:
ja_jp: そのため、今回のリリースでは注目すべき新機能のリストが少し足りません。

source: Thus the upgrade is highly recommended.
ja_jp: したがって、アップグレードを強くお勧めします。

source: Thus we do see reports from such tools falsely claiming Quarkus or some of its extensions in its ecosystem are affected although in practice they are not.
ja_jp: そのため、このようなツールから、Quarkusやそのエコシステム内の一部のエクステンションが影響を受けていると偽って報告されることがありますが、実際には影響を受けていません。

source: Thus why you should always use the Quarkus-managed `ValidatorFactory` by injecting an instance of `ValidatorFactory` or directly an instance of `Validator` using CDI injection.
ja_jp: これが、 `ValidatorFactory` のインスタンスを注入するか、CDIインジェクションを使用して `Validator` のインスタンスを直接注入することで、Quarkusが管理する `ValidatorFactory` を常に使用しなければならない理由です。

source: Thus, a duplicated context is associated with each processing unit. A duplicated context is still associated with a root context, and scheduling operations using a duplicated context run them in the associated root context. But, unlike the root context, they are not shared between processing units. Yet, continuations of a processing unit use the same duplicated context. So, in the previous code snippet, the continuation is not only called on the same event loop but on the same duplicated context (supposing that the captured context is a duplicated context, more on that later).
ja_jp: このように、複製コンテキストは各処理ユニットに関連付けられています。 複製コンテキストは、依然としてルートコンテキストに関連付けられており、複製コンテキストを使用するスケジューリング操作は、関連付けられたルートコンテキストで実行されます。 しかし、ルートコンテキストとは異なり、処理ユニット間で共有されることはありません。 しかし、ある処理ユニットの継続は、同じ複製コンテキストを使用します。そのため、先ほどのコードスニペットでは、同じイベントループだけでなく、同じ複製コンテキストで呼び出されます（キャプチャされたコンテキストが複製コンテキストであると仮定します。）

source: Thus, as demonstrated in our example, you can fully use injection in your constraint validator beans.
ja_jp: このように、例で示したように、制約バリデーターBeanでインジェクションを完全に使用することができます。

source: Thus, client can connect to this web socket endpoint using `ws://localhost:8080/chat/your-name`. If TLS is used, the URL is `wss://localhost:8443/chat/your-name`.
ja_jp: したがって、クライアントは `ws://localhost:8080/chat/your-name` を使用して、この Web ソケットエンドポイントに接続できます。 TLS が使用されている場合、URL は `wss://localhost:8443/chat/your-name` です。

source: Thus, even though extra JDBC URL properties can be set in your `application.properties` file, specific properties supported by the Testcontainers JDBC driver such as `TC_INITSCRIPT`, `TC_INITFUNCTION`, `TC_DAEMON`, `TC_TMPFS` are not supported.
ja_jp: そのため、 `application.properties` ファイルで追加の JDBC URL プロパティを設定することはできても、 `TC_INITSCRIPT` , `TC_INITFUNCTION` , `TC_DAEMON` , `TC_TMPFS` のような Testcontainers JDBC ドライバがサポートする特定のプロパティはサポートされません。

source: Thus, the `all-open` Kotlin compiler plugin allows us to configure the compiler to *not* mark as `final` classes that have certain annotations. In the snippet above, we have specified that classes annotated with `jakarta.ws.rs.Path` should not be `final`.
ja_jp: そのため、 `all-open` Kotlinコンパイラ・プラグインでは、特定のアノテーションを持つクラスを `final` としてマーク *しない * ようにコンパイラを設定することができます。上記のスニペットでは、 `jakarta.ws.rs.Path` のアノテーションを持つクラスは `final` としないように指定しています。

source: Thus, the `all-open` Kotlin compiler plugin allows us to configure the compiler to *not* mark as `final` classes that have certain annotations. In the snippet above, we have specified that classes annotated with `javax.ws.rs.Path` should not be `final`.
ja_jp: このように、 `all-open` Kotlin コンパイラプラグインを使うと、特定のアノテーションを持つクラスを `final` としてマークし *ない* ようにコンパイラを設定することができます。上のスニペットでは、 `javax.ws.rs.Path` でアノテーションされたクラスを `final` ではないようにします。

source: Thus, the configuration of the WebSocket server is done in the `quarkus.http.` configuration section.
ja_jp: したがって、WebSocket サーバーの設定は `quarkus.http.` 設定セクションで行われます。

source: Thus, the gain of using reactive return types in RESTEasy Classic is a syntactic gain, not a runtime gain - the underlying hardware isn’t used more efficiently despite the use of reactive types.
ja_jp: このように、RESTEasy Classic でリアクティブな戻り値型を使用することで得られる利益は、ランタイムの利益ではなく、構文的な利益です。リアクティブ型を使用していても、基礎となるハードウェアが、より効率的に使用されることはありません。

source: Thus, triggering a registration on the client requires obtaining a challenge from the server (see <<Obtain a registration challenge>>), which will then be returned to the client which uses that to create new credentials and send them to the server (see <<Trigger a registration>>) which will store the credentials and log you in:
ja_jp: したがって、クライアントで登録をトリガーするには、サーバーからチャレンジを取得する必要があります (<<Obtain a registration challenge>> を参照)。取得したチャレンジはクライアントに返され、クライアントはそれを使用して 新しい認証情報を作成し、それをサーバーに送信します (<<Trigger a registration>> を参照)。 サーバーは、認証情報を保存し、ユーザーをログインさせます。

source: Thus, we released 1.13.6.Final today to mitigate the issue.
ja_jp: そこで、この問題を軽減するために、本日1.13.6.Finalをリリースしました。

source: Time
ja_jp: 時間

source: Time Limited Credentials
ja_jp: 期間限定クレデンシャル

source: Time Zone Configuration Property Example
ja_jp: タイムゾーン設定プロパティーの例

source: Time Zone Example
ja_jp: タイムゾーンの例

source: Time Zones
ja_jp: タイムゾーン

source: Time for our semi-annually Q&A session where we drive the episode using your questions!
ja_jp: 半期に一度のQ&Aの時間です！皆さんからの質問でエピソードを進めていきます。

source: Time taken to process the request, in micros
ja_jp: リクエストの処理にかかった時間 ( マイクロ秒 )

source: Time taken to process the request, in millis
ja_jp: リクエストの処理にかかった時間 (ミリ秒 )

source: Time taken to process the request, in nanos
ja_jp: リクエストの処理にかかった時間 ( ナノ秒 )

source: Time taken to process the request, in seconds
ja_jp: リクエストの処理にかかった時間 ( 秒単位 )

source: Time to play with your application
ja_jp: アプリケーションで遊ぶ時間

source: Time to rock the Java world!
ja_jp: Java の世界を揺るがす時です！

source: Time to test and install to our local maven repository!
ja_jp: テストしてローカルの maven リポジトリーにインストールしてみましょう。

source: Time to use your new extension
ja_jp: 新しいエクステンションの使用

source: Time zone
ja_jp: タイムゾーン

source: Time zones
ja_jp: タイムゾーン

source: Timeout of unacked messages
ja_jp: 非暗号化メッセージのタイムアウト

source: Timers and Distribution Summaries are not available in the OpenTelemetry API. Instead, use Histograms.
ja_jp: タイマーおよびディストリビューションの概要は OpenTelemetry API では使用できません。 代わりに、ヒストグラムを使用します。

source: Timers and distribution summaries in Micrometer are very similar. Both allow you to record an observed value, which will be aggregated with other recorded values and stored as a sum. Micrometer also increments a counter to indicate the number of measurements that have been recorded and tracks the maximum observed value (within a decaying interval).
ja_jp: Micrometerのタイマーとディストリビューション・サマリーは非常によく似ています。どちらも観測値を記録することができ、その値は他の記録された値と合算されて合計値として保存されます。また、Micrometerでは、記録された測定値の数を示すカウンタをインクリメントし、（減衰間隔内で）最大の観測値を追跡します。

source: Timers and distribution summaries in Micrometer are very similar. Both meters record data, and can capture additional histogram or percentile data. While distribution summaries can be use for arbitrary types of data, timers are optimized for measuring time and durations.
ja_jp: Micrometer のタイマーとディストリビューションサマリーは非常に似ています。両方のメーターはデータを記録し、追加のヒストグラムまたはパーセンタイルデータを取得できます。ディストリビューションサマリーは任意のタイプのデータに使用できますが、タイマーは時間と期間の測定に最適化されています。
